{"doc_id": 1001, "title": "2025 Data Retention Policy", "last_modified": "2025-01-15", "raw_text": "Section 3.1: All PII data must be fully anonymized or securely deleted exactly 36 months after the customer's account is marked 'inactive'. This process must be audited weekly. Non-PII data, such as aggregated usage statistics, may be retained indefinitely for analytics purposes. The Head of Compliance is the final approver for any exceptions."}
{"doc_id": 1002, "title": "Employee Travel & Expense Guidelines", "last_modified": "2024-11-01", "raw_text": "Employees are limited to $150/night for hotel stays. Receipts must be uploaded within 14 days of travel completion. Failure to submit on time will result in a 30-day reimbursement delay. Airfare is strictly Economy class."}
{"doc_id": 1003, "title": "Q1 Performance Review Process", "last_modified": "2025-01-05", "raw_text": "The Q1 review cycle runs from Feb 1st to Feb 28th. Managers must use the 'Goal Alignment' form. The final review score requires sign-off from both the Manager and the Department Head. Employees must acknowledge the review within 3 business days."}
{"doc_id": 1004, "title": "Remote Work Equipment Stipend", "last_modified": "2024-08-10", "raw_text": "Full-time employees are eligible for a one-time $500 stipend for home office equipment (monitor, chair, keyboard). This benefit is only available after 90 days of continuous employment. It is non-transferable."}
{"doc_id": 1005, "title": "Cloud Security Policy (AWS/GCP)", "last_modified": "2025-02-20", "raw_text": "All production environment access keys must be rotated every 90 days. MFA is mandatory for all console logins. Non-compliance will result in immediate account lockout and a security audit."}
{"doc_id": 1006, "title": "Product Bug Reporting & Severity", "last_modified": "2024-12-01", "raw_text": "CRITICAL bugs are defined as system-wide failure or data loss, requiring a 1-hour response time. MAJOR bugs affect a core feature but have a workaround, requiring a 4-hour response. All reports must include browser version and error logs."}
{"doc_id": 1007, "title": "Paid Time Off (PTO) Accrual", "last_modified": "2024-10-01", "raw_text": "Full-time employees accrue 1.67 days of PTO per month. There is a maximum rollover of 5 days into the next calendar year. Sick time is managed separately and does not count against this balance."}
{"doc_id": 1008, "title": "Vendor Onboarding Procedure", "last_modified": "2025-03-10", "raw_text": "All new vendors require a signed NDA and a completed W-9 form before any statement of work (SOW) is issued. The legal team must approve the final contract before any payment is authorized."}
{"doc_id": 1009, "title": "Quarterly Sales Commission Structure", "last_modified": "2025-01-01", "raw_text": "Base commission is 5% for hitting 100% of the quarterly target. A 15% accelerator applies to any sales volume exceeding 120% of the target. Commissions are paid 30 days after the quarter closes."}
{"doc_id": 1010, "title": "IT Asset Disposal Protocol", "last_modified": "2024-07-20", "raw_text": "All retired computing equipment must undergo a triple-pass data wipe. The serial number must be logged in the asset management system as 'Disposed'. Physical destruction is required for all storage media."}
